Tekla Open API Reference for Tekla Structures 2025
ProfileItemCrossSection.AddProfileItemUserParamter Method
 adds a new profile item user parameter.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void AddProfileItemUserParamter(
	string property,
	string alblString,
	string symbol,
	Object value,
	ProfileItemParameter.ParameterUnitTypeEnum ParameterUnitType,
	int crossSectionNumber
)
Public Sub AddProfileItemUserParamter (
	property As String,
	alblString As String,
	symbol As String,
	value As Object,
	ParameterUnitType As ProfileItemParameter.ParameterUnitTypeEnum,
	crossSectionNumber As Integer
)
Parameters
property
Type: System.String
The name of the property.
alblString
Type: System.String
The translation string.
symbol
Type: System.String
The property symbol.
value
Type: System.Object
The value of the property.
ParameterUnitType
Type: Tekla.Structures.Catalogs.ProfileItemParameter.ParameterUnitTypeEnum
The property value unit type.
crossSectionNumber
Type: System.Int32
The cross-section number.
See Also
Reference
ProfileItemCrossSection Class
Tekla.Structures.Catalogs Namespace